# 'brew tap'
tap "homebrew/cask"


# 'brew install'
brew "zsh"
brew "vim"
brew "wget"
brew "go"
brew "jq"
brew "minikube"
brew "vips"
brew "direnv"
brew "golangci-lint"
brew "skaffold"
brew "helm"
brew "kustomize"
brew "helmfile"
brew "peco"

# 'brew install --cask'
cask "google-chrome"
cask "iterm2"
cask "docker"
cask "visual-studio-code"
cask "authy"
cask "slack"
cask "goland"
cask "pycharm"
cask "webstorm"
cask "phpstorm"
cask "karabiner-elements"
cask "google-japanese-ime"

# 'mas install'
mas "slack", id:803453959
mas "wechat", id:836500024
mas "line", id:539883307
mas "qq", id:451108668
